## 🗺️ Terraform Plan: Dev

<details>
<summary>📋 Plan Output (click to expand)</summary>

```terraform
time=2025-12-14T10:36:36Z level=info msg=The stack at /home/runner/work/interview/interview/sre/terragrunt/environments/dev will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/ecr
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/helm-s3-repo
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking

Group 2
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks-cluster

Group 3
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/iam
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/observability/amp

Group 4
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks-addons
- Module /home/runner/work/interview/interview/sre/terragrunt/environments/dev/observability/grafana


time=2025-12-14T10:36:36Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/ecr into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/ecr/.terragrunt-cache/ANGFFSODJUnTUlEvlxMkVVzyuBs/b2UBPy3t3ziB0pwKcBzJAJ_AH60 prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/ecr] 
time=2025-12-14T10:36:36Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/helm-s3-repo into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/helm-s3-repo/.terragrunt-cache/UTa04DBkd26JggUMz3RcRna8cE0/HBgrysaS8YruO8t34cXU5hUMp5o prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/helm-s3-repo] 
time=2025-12-14T10:36:36Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/networking into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking/.terragrunt-cache/U5oswpjzT80__bq6z5CjLFPgEhE/oe-HFdXMekaLtOb26xJTuUQbvwc prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/networking] 

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...

Initializing provider plugins...
- Finding hashicorp/helm versions matching "~> 2.11"...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
- Finding hashicorp/helm versions matching "~> 2.11"...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding hashicorp/aws versions matching "~> 5.0"...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Installing hashicorp/helm v2.17.0...
- Installing hashicorp/kubernetes v2.38.0...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.aws_caller_identity.current: Reading...
aws_ecr_repository.main["backend"]: Refreshing state... [id=backend]
data.aws_caller_identity.current: Read complete after 0s [id=596308305263]
aws_ecr_lifecycle_policy.main["backend"]: Refreshing state... [id=backend]
aws_ecr_repository_policy.github_access["backend"]: Refreshing state... [id=backend]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_s3_bucket.helm_charts: Refreshing state... [id=tekmetric-helm-charts-dev]
data.aws_region.current: Reading...
aws_cloudwatch_log_group.flow_logs[0]: Refreshing state... [id=/aws/vpc/tekmetric-dev]
aws_vpc.main: Refreshing state... [id=vpc-0c3183a9704d830e3]
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_iam_role.flow_logs[0]: Refreshing state... [id=tekmetric-dev-vpc-flow-logs]
aws_iam_role_policy.flow_logs[0]: Refreshing state... [id=tekmetric-dev-vpc-flow-logs:tekmetric-dev-vpc-flow-logs]
aws_s3_bucket_public_access_block.helm_charts: Refreshing state... [id=tekmetric-helm-charts-dev]
aws_s3_bucket_versioning.helm_charts: Refreshing state... [id=tekmetric-helm-charts-dev]
aws_s3_bucket_server_side_encryption_configuration.helm_charts: Refreshing state... [id=tekmetric-helm-charts-dev]
aws_s3_bucket_lifecycle_configuration.helm_charts: Refreshing state... [id=tekmetric-helm-charts-dev]
data.aws_iam_policy_document.helm_s3_access: Reading...
data.aws_iam_policy_document.helm_s3_access: Read complete after 0s [id=1390239670]
aws_iam_policy.helm_s3_access: Refreshing state... [id=arn:aws:iam::596308305263:policy/dev-helm-s3-access]
aws_iam_role_policy_attachment.github_actions_helm_s3: Refreshing state... [id=GitHubActionsRole-dev-20251212202310720100000001]
aws_subnet.private[2]: Refreshing state... [id=subnet-0e3ad67955df7be55]
aws_subnet.private[0]: Refreshing state... [id=subnet-09e6789f3ce817434]
aws_route_table.private[0]: Refreshing state... [id=rtb-081a4e6081aa83855]
aws_security_group.eks_cluster: Refreshing state... [id=sg-0fb260cb03efc55b1]
aws_subnet.private[1]: Refreshing state... [id=subnet-0cb5b6ccb645a5dc9]
aws_subnet.public[2]: Refreshing state... [id=subnet-037d51f2c40c3afd6]
aws_security_group.vpc_endpoints[0]: Refreshing state... [id=sg-01d9ef5bce2a0c7bd]
aws_subnet.public[0]: Refreshing state... [id=subnet-0490c1f00cf452058]
aws_flow_log.main[0]: Refreshing state... [id=fl-0c2f13d458947db8d]
aws_subnet.public[1]: Refreshing state... [id=subnet-05e73db6c0fdc6750]
aws_security_group.eks_nodes: Refreshing state... [id=sg-0a50859106e1a5fff]
aws_internet_gateway.main: Refreshing state... [id=igw-0a21199ed9d97ae6c]
aws_security_group_rule.cluster_egress_all: Refreshing state... [id=sgrule-1211993477]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01fbff87c233ba29e]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-057bf95af5377b34b]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03e09459e5710963e]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f93f575c9fbd1718]
aws_route_table.public: Refreshing state... [id=rtb-001cbda9acf0da846]
aws_vpc_endpoint.ecr_dkr[0]: Refreshing state... [id=vpce-0dfc52593175149d8]
aws_vpc_endpoint.ecr_api[0]: Refreshing state... [id=vpce-05e3b30541be9654a]
aws_security_group_rule.cluster_ingress_nodes: Refreshing state... [id=sgrule-892989344]
aws_security_group_rule.nodes_internal: Refreshing state... [id=sgrule-2472755276]
aws_security_group_rule.nodes_cluster_ingress: Refreshing state... [id=sgrule-2840776275]
aws_security_group_rule.nodes_egress_all: Refreshing state... [id=sgrule-907394866]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e630c3f2b0a94100]
aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-0fb647055c852bf07]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0aa52d0b6be2eee07]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b386295c66904f39]
aws_nat_gateway.main[0]: Refreshing state... [id=nat-083a0f0a6fef33566]
aws_route.private_nat[0]: Refreshing state... [id=r-rtb-081a4e6081aa838551080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
╷
│ Warning: Invalid Attribute Combination
│ 
│   with aws_s3_bucket_lifecycle_configuration.helm_charts,
│   on main.tf line 48, in resource "aws_s3_bucket_lifecycle_configuration" "helm_charts":
│   48: resource "aws_s3_bucket_lifecycle_configuration" "helm_charts" {
│ 
│ No attribute specified when one (and only one) of
│ [rule[0].filter,rule[0].prefix] is required
│ 
│ This will be an error in a future version of the provider
│ 
│ (and one more similar warning elsewhere)
╵

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2025-12-14T10:36:52Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/eks into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks-cluster/.terragrunt-cache/Fr48-vIX23rIjqft_o5DCa4kQ3s/R4houoVHchUziigUPrFTxzYi9ew prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks-cluster] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/tls...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/tls v4.1.0...
- Installed hashicorp/tls v4.1.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.aws_caller_identity.current: Reading...
aws_iam_group.eks_admins[0]: Refreshing state... [id=eks-dev-admins]
aws_cloudwatch_log_group.cluster: Refreshing state... [id=/aws/eks/tekmetric-dev/cluster]
aws_iam_role.node_group: Refreshing state... [id=tekmetric-dev-node-group-role]
aws_iam_role.cluster: Refreshing state... [id=tekmetric-dev-cluster-role]
data.aws_caller_identity.current: Read complete after 0s [id=596308305263]
aws_iam_role.eks_admins[0]: Refreshing state... [id=tekmetric-dev-admins-role]
aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=tekmetric-dev-cluster-role-20251212115417839700000001]
aws_iam_role_policy_attachment.cluster_vpc_policy: Refreshing state... [id=tekmetric-dev-cluster-role-20251212115417852900000002]
aws_iam_group_policy.assume_eks_admin_role[0]: Refreshing state... [id=eks-dev-admins:AssumeEKSAdminRole]
aws_iam_role_policy_attachment.node_group_worker_policy: Refreshing state... [id=tekmetric-dev-node-group-role-20251212115417919000000003]
aws_iam_role_policy_attachment.node_group_registry_policy: Refreshing state... [id=tekmetric-dev-node-group-role-20251212115417961100000004]
aws_iam_role_policy_attachment.node_group_cni_policy: Refreshing state... [id=tekmetric-dev-node-group-role-20251212115417993800000005]
aws_iam_role_policy_attachment.node_group_cloudwatch_policy: Refreshing state... [id=tekmetric-dev-node-group-role-20251213222529718200000001]
aws_eks_cluster.main: Refreshing state... [id=tekmetric-dev]
data.aws_eks_addon_version.kube_proxy: Reading...
data.aws_eks_addon_version.coredns: Reading...
aws_eks_node_group.main["general"]: Refreshing state... [id=tekmetric-dev:tekmetric-dev-general]
data.aws_eks_addon_version.ebs_csi_driver: Reading...
aws_eks_access_entry.role_admin[0]: Refreshing state... [id=tekmetric-dev:arn:aws:iam::596308305263:role/tekmetric-dev-admins-role]
aws_eks_access_entry.github_actions[0]: Refreshing state... [id=tekmetric-dev:arn:aws:iam::596308305263:role/GitHubActionsRole-dev]
data.aws_eks_addon_version.vpc_cni: Reading...
data.tls_certificate.cluster[0]: Reading...
data.tls_certificate.cluster[0]: Read complete after 0s [id=0c37bb608751c2a14704338d4b14c14e6dbe88ac]
aws_iam_openid_connect_provider.cluster[0]: Refreshing state... [id=arn:aws:iam::596308305263:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/BA5922C36849B613839D232D6C7C22A0]
data.aws_eks_addon_version.vpc_cni: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.ebs_csi_driver: Read complete after 0s [id=aws-ebs-csi-driver]
data.aws_eks_addon_version.coredns: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.kube_proxy: Read complete after 0s [id=kube-proxy]
aws_eks_access_policy_association.role_admin[0]: Refreshing state... [id=tekmetric-dev#arn:aws:iam::596308305263:role/tekmetric-dev-admins-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_policy_association.github_actions[0]: Refreshing state... [id=tekmetric-dev#arn:aws:iam::596308305263:role/GitHubActionsRole-dev#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2025-12-14T10:37:04Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/amp into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/observability/amp/.terragrunt-cache/awhSlVYYS_sLl9eONB4xh7l9APg/TJVSeqteEU1XpPOcN_CCBpg1E-4 prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/observability/amp] 
time=2025-12-14T10:37:04Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/iam into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/iam/.terragrunt-cache/TTvDEKScY6XCuaDe9pYXw_X7gCc/WWu7LDFPYb_H9GUnGMv5p9t_4f4 prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/iam] 

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Finding hashicorp/aws versions matching "~> 5.0"...

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/helm v2.17.0...
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_iam_policy.cluster_autoscaler[0]: Refreshing state... [id=arn:aws:iam::596308305263:policy/ClusterAutoscaler-dev]
aws_iam_role.ebs_csi_driver[0]: Refreshing state... [id=EBSCSIDriver-dev]
aws_iam_role.aws_load_balancer_controller[0]: Refreshing state... [id=AWSLoadBalancerController-dev]
aws_iam_role.cluster_autoscaler[0]: Refreshing state... [id=ClusterAutoscaler-dev]
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
aws_prometheus_workspace.main: Refreshing state... [id=ws-31072996-666c-4020-957d-794b042fbd3a]
aws_sns_topic.alerts: Refreshing state... [id=arn:aws:sns:us-east-1:596308305263:tekmetric-dev-amp-alerts]
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=596308305263]
aws_iam_role.prometheus_agent: Refreshing state... [id=tekmetric-dev-prometheus-agent-role]
aws_iam_role_policy_attachment.ebs_csi_driver[0]: Refreshing state... [id=EBSCSIDriver-dev-20251212121452955500000002]
aws_sns_topic_subscription.alerts_email[0]: Refreshing state... [id=arn:aws:sns:us-east-1:596308305263:tekmetric-dev-amp-alerts:cecff70f-bcdc-4d6f-a958-5a182615a256]
aws_iam_role_policy_attachment.cluster_autoscaler[0]: Refreshing state... [id=ClusterAutoscaler-dev-20251212121452818000000001]
aws_iam_role_policy.aws_load_balancer_controller[0]: Refreshing state... [id=AWSLoadBalancerController-dev:AWSLoadBalancerControllerPolicy]
aws_iam_role_policy.prometheus_agent_sns: Refreshing state... [id=tekmetric-dev-prometheus-agent-role:sns-publish]
aws_prometheus_alert_manager_definition.main: Refreshing state... [id=ws-31072996-666c-4020-957d-794b042fbd3a]
aws_prometheus_rule_group_namespace.alerts: Refreshing state... [id=arn:aws:aps:us-east-1:596308305263:rulegroupsnamespace/ws-31072996-666c-4020-957d-794b042fbd3a/backend-alerts]
aws_iam_role_policy.prometheus_agent_amp: Refreshing state... [id=tekmetric-dev-prometheus-agent-role:amp-remote-write]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2025-12-14T10:37:16Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/eks-addons into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks-addons/.terragrunt-cache/9l9xBtCwb3BSzP1RP0IXI7nlkmI/1nANd8CWzowA2V3C0BhE0gu76TI prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/eks-addons] 
time=2025-12-14T10:37:16Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/interview/interview/sre/terraform/modules/grafana into /home/runner/work/interview/interview/sre/terragrunt/environments/dev/observability/grafana/.terragrunt-cache/UTjbLNztlFVtnocDBbNnflqiGPo/XdgqsEImRGebkhcFn--D0C1APKM prefix=[/home/runner/work/interview/interview/sre/terragrunt/environments/dev/observability/grafana] 

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
- Finding hashicorp/helm versions matching "~> 2.11"...
- Finding hashicorp/aws versions matching "~> 5.0"...

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching "~> 2.23"...
- Finding hashicorp/helm versions matching "~> 2.11"...
- Installing hashicorp/kubernetes v2.38.0...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/kubernetes v2.38.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
data.aws_eks_addon_version.coredns: Reading...
data.aws_eks_addon_version.ebs_csi_driver: Reading...
data.aws_eks_addon_version.cloudwatch_observability[0]: Reading...
data.aws_eks_addon_version.kube_proxy: Reading...
data.aws_eks_addon_version.vpc_cni: Reading...
data.aws_eks_addon_version.coredns: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.ebs_csi_driver: Read complete after 0s [id=aws-ebs-csi-driver]
aws_eks_addon.coredns: Refreshing state... [id=tekmetric-dev:coredns]
aws_eks_addon.ebs_csi_driver[0]: Refreshing state... [id=tekmetric-dev:aws-ebs-csi-driver]
data.aws_eks_addon_version.cloudwatch_observability[0]: Read complete after 0s [id=amazon-cloudwatch-observability]
aws_eks_addon.cloudwatch_observability[0]: Refreshing state... [id=tekmetric-dev:amazon-cloudwatch-observability]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_grafana_workspace.main will be created
  + resource "aws_grafana_workspace" "main" {
      + account_access_type       = "CURRENT_ACCOUNT"
      + arn                       = (known after apply)
      + authentication_providers  = [
          + "AWS_SSO",
        ]
      + configuration             = (known after apply)
      + data_sources              = [
          + "PROMETHEUS",
        ]
      + endpoint                  = (known after apply)
      + grafana_version           = (known after apply)
      + id                        = (known after apply)
      + name                      = "tekmetric-dev"
      + notification_destinations = [
          + "SNS",
        ]
      + permission_type           = "SERVICE_MANAGED"
      + role_arn                  = (known after apply)
      + saml_configuration_status = (known after apply)
      + tags                      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "grafana"
          + "Name"        = "tekmetric-dev-grafana"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "grafana"
          + "Name"        = "tekmetric-dev-grafana"
          + "Project"     = "tekmetric"
          + "Repository"  = "interview"
        }
    }

  # aws_iam_role.grafana will be created
  + resource "aws_iam_role" "grafana" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tekmetric-dev-grafana-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "grafana"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "grafana"
          + "Project"     = "tekmetric"
          + "Repository"  = "interview"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.grafana_amp_query will be created
  + resource "aws_iam_role_policy" "grafana_amp_query" {
      + id          = (known after apply)
      + name        = "amp-query"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:ListWorkspaces",
                          + "aps:DescribeWorkspace",
                          + "aps:QueryMetrics",
                          + "aps:GetLabels",
                          + "aps:GetSeries",
                          + "aps:GetMetricMetadata",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:us-east-1:596308305263:workspace/ws-31072996-666c-4020-957d-794b042fbd3a"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.grafana_sns[0] will be created
  + resource "aws_iam_role_policy" "grafana_sns" {
      + id          = (known after apply)
      + name        = "sns-publish"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:Publish",
                          + "sns:ListTopics",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + grafana_role_arn   = (known after apply)
  + grafana_role_name  = "tekmetric-dev-grafana-role"
  + workspace_arn      = (known after apply)
  + workspace_endpoint = (known after apply)
  + workspace_id       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
data.aws_eks_addon_version.vpc_cni: Read complete after 0s [id=vpc-cni]
aws_eks_addon.vpc_cni: Refreshing state... [id=tekmetric-dev:vpc-cni]
data.aws_eks_addon_version.kube_proxy: Read complete after 0s [id=kube-proxy]
aws_eks_addon.kube_proxy: Refreshing state... [id=tekmetric-dev:kube-proxy]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

</details>

**Next Steps:**
- Review the plan above
- Comment `/terraform apply dev` to apply these changes
- Or see [full logs](https://github.com/actekmetric/interview/actions/runs/20206683321)

**Available commands:**
- `/terraform plan dev` - Re-run plan for dev
- `/terraform apply dev` - Apply changes to dev
- `/terraform plan qa` - Plan for QA
- `/terraform apply qa` - Apply to QA (requires approval)
